let start = 1900;
	let end = new Date().getFullYear();

	let select = document.getElementById("year");
	for(let year = start; year <= end; year++ ){
		let opt = document.createElement("option");
		opt.value = year;
		opt.innerHTML = year;
		select.appendChild(opt);

	};

	let obj = [ {name:"rat", yıl:["1900","1912","1924", "1936", "1948", "1960", "1972", "1984", "1996", "2008", "2020", "2032"]},
            {name:"Ox",  yıl:["1901","1913","1925", "1937", "1949", "1961", "1973", "1985", "1997", "2009", "2021", "2033"]},
            {name:"Tiger", yıl:["1902","1914","1926", "1938", "1950", "1962", "1974", "1986", "1998", "2010", "2022", "2034"]},
            {name:"Rabbit", yıl:["1903","1915","1927", "1939", "1951", "1963", "1975", "1987", "1999", "2011", "2023", "2035"]},
            {name:"dragon", yıl:["1904","1916","1928", "1940", "1952", "1964", "1976", "1988", "2000", "2012", "2024", "2036"]},
            {name:"Snake", yıl:["1905","1917","1929", "1941", "1953", "1965", "1977", "1989", "2001", "2013", "2025", "2037"]},
            {name:"Horse", yıl:["1906","1918","1930", "1942", "1954", "1966", "1978", "1990", "2002", "2014", "2026", "2038"]},
            {name:"Sheep", yıl:["1907","1919","1931", "1943", "1955", "1967", "1979", "1991", "2003", "2015", "2027", "2039"]},
            {name:"Monkey", yıl:["1908","1920","1932", "1944", "1956", "1968", "1980", "1992", "2004", "2016", "2028", "2040"]},
            {name:"Rooster", yıl:["1909","1921","1933", "1945", "1957", "1969", "1981", "1993", "2005", "2017", "2029", "2041"]},
            {name:"Dog", yıl:["1910","1922","1934", "1946", "1958", "1970", "1982", "1994", "2006", "2018", "2030", "2042"]},
            {name:"Pig", yıl:["1911","1923","1935", "1947", "1959", "1971", "1983", "1995", "2007", "2019", "2031", "2043"]},

            ] ;

let year = document.getElementById("year");
year.onchange = function(e) {
	let yıl2 = e.target.value;
	 function yearToName(yıl) {
  	return obj.find(x => x.yıl.includes(yıl)).name };
	const textarea = document.querySelector("#textarea");
	let info = yearToName(yıl2);
	textarea.innerHTML = info;
	
	
};